Autodesk.Revit.DB.EditScope.Commit(Autodesk.Revit.DB.IFailuresPreprocessor)
Finishes the edit scope.
Remarks:
All the changes made after starting the EditScope will be committed. Changes will be merged into one transaction.
failurePreprocessor:
Callback to be invoked in the beginning of failure processing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
EditScope is not active. EditScope can only be committed or cancelled when it is active.
-or-
EditScope cannot be closed, for there is a transaction or transaction group still open in the document.
Since:
2014

Autodesk.Revit.DB.EditScope.Cancel
Cancels the edit scope.
Remarks:
All the changes made after starting the EditScope will be rolled back.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
EditScope is not active. EditScope can only be committed or cancelled when it is active.
-or-
EditScope cannot be closed, for there is a transaction or transaction group still open in the document.
Since:
2014

Autodesk.Revit.DB.EditScope.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.EditScope.IsActive
Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
Remarks:
Starting the edit scope is not permitted when it is active.
Canceling/committing is not allowed   when the edit scope is not active.
Since:
2014

Autodesk.Revit.DB.EditScope
The base class for a scope object that provides special access and limitations related to editing certain elements.
Remarks:
Derivations of this class provide specific functionality to manage edit modes for specific purposes.
Since:
2014